{
    "Symbol": "ADBE",
    "AssetType": "Common Stock",
    "Name": "Adobe Inc",
    "Description": "Adobe Inc. operates as a diversified software company worldwide. Its Digital Media segment provides tools and solutions that enable individuals, teams, and enterprises to create, publish, promote, and monetize their digital content. Its flagship product is Creative Cloud, a subscription service that allows customer to download and access the latest versions of its creative products. This segment serves content creators, experience designers, app developers, enthusiasts, students, social media users, and creative professionals, as well as marketing departments and agencies, companies and publishers. The company's Digital Experience segment offers products, services, and solutions for creating, managing, executing, measuring, monetizing and optimizing customer experiences from advertising to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, marketing executives, information management and technology executives, product development executives, and sales and support executives. Its Publishing segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as publishing needs of technical and business, and original equipment manufacturers (OEMs) printing businesses. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end-users through app stores and through its Website at adobe.com. It also distributes products and services through a network of distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and OEMs. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. The company was founded in 1982 and is headquartered in San Jose, California.",
    "Exchange": "NASDAQ",
    "Currency": "USD",
    "Country": "USA",
    "Sector": "Technology",
    "Industry": "SoftwareInfrastructure",
    "Address": "345 Park Avenue, San Jose, CA, United States, 95110-2704",
    "FullTimeEmployees": "22634",
    "FiscalYearEnd": "November",
    "LatestQuarter": "2020-08-31",
    "MarketCapitalization": "234342727680",
    "EBITDA": "4558889984",
    "PERatio": "60.9068",
    "PEGRatio": "2.308",
    "BookValue": "24.402",
    "DividendPerShare": "None",
    "DividendYield": "0",
    "EPS": "7.94",
    "RevenuePerShareTTM": "25.805",
    "ProfitMargin": "0.3105",
    "OperatingMarginTTM": "0.321",
    "ReturnOnAssetsTTM": "0.1175",
    "ReturnOnEquityTTM": "0.3518",
    "RevenueTTM": "12436296704",
    "GrossProfitTTM": "9498577000",
    "DilutedEPSTTM": "7.94",
    "QuarterlyEarningsGrowthYOY": "0.224",
    "QuarterlyRevenueGrowthYOY": "0.138",
    "AnalystTargetPrice": "552.03",
    "TrailingPE": "60.9068",
    "ForwardPE": "43.4783",
    "PriceToSalesRatioTTM": "18.92",
    "PriceToBookRatio": "19.8064",
    "EVToRevenue": "18.6112",
    "EVToEBITDA": "48.2334",
    "Beta": "0.9724",
    "52WeekHigh": "536.88",
    "52WeekLow": "255.1314",
    "50DayMovingAverage": "487.1347",
    "200DayMovingAverage": "431.7361",
    "SharesOutstanding": "479719008",
    "SharesFloat": "477464304",
    "SharesShort": "4366911",
    "SharesShortPriorMonth": "3971726",
    "ShortRatio": "1.1",
    "ShortPercentOutstanding": "0.01",
    "ShortPercentFloat": "0.0091",
    "PercentInsiders": "0.294",
    "PercentInstitutions": "89.1",
    "ForwardAnnualDividendRate": "0",
    "ForwardAnnualDividendYield": "0",
    "PayoutRatio": "0",
    "DividendDate": "None",
    "ExDividendDate": "2005-03-24",
    "LastSplitFactor": "2:1",
    "LastSplitDate": "2005-05-24"
}