{
    "Symbol": "CMCSA",
    "AssetType": "Common Stock",
    "Name": "Comcast Corporation",
    "Description": "Comcast Corporation operates as a media and technology company worldwide. It operates through Cable Communications, Cable Networks, Broadcast Television, Filmed Entertainment, Theme Parks, and Sky segments. The Cable Communications segment offers cable services, including high-speed Internet, video, voice, wireless, and security and automation services to residential and business customers under the Xfinity brand; and advertising services. The Cable Networks segment operates national cable networks that provide various entertainment, news and information, and sports content; regional sports and news networks; international cable networks; and various digital properties, including brand-aligned Websites, as well as engages in the cable television studio production operations. The Broadcast Television segment operates NBC and Telemundo broadcast networks, NBC and Telemundo local broadcast television stations, broadcast television studio production operations, and various digital properties. The Filmed Entertainment segment produces, acquires, markets, and distributes filmed entertainment under the Universal Pictures, Illumination, DreamWorks Animation, and Focus Features names. It also develops, produces, and licenses stage plays; and distributes filmed entertainment produced by third parties. The Theme Parks segment operates Universal theme parks in Orlando, Florida; Hollywood, California; and Osaka, Japan. The Sky segment offers direct-to-consumer services, such as video, high-speed Internet, voice, and wireless phone services; and content services comprising operating entertainment networks, the Sky News broadcast network, and Sky Sports networks. The company also owns the Philadelphia Flyers, as well as the Wells Fargo Center arena in Philadelphia, Pennsylvania. Comcast Corporation was founded in 1963 and is headquartered in Philadelphia, Pennsylvania.",
    "Exchange": "NASDAQ",
    "Currency": "USD",
    "Country": "USA",
    "Sector": "Communication Services",
    "Industry": "Entertainment",
    "Address": "One Comcast Center, Philadelphia, PA, United States, 19103-2838",
    "FullTimeEmployees": "190000",
    "FiscalYearEnd": "December",
    "LatestQuarter": "2020-06-30",
    "MarketCapitalization": "209219895296",
    "EBITDA": "32970999808",
    "PERatio": "18.0964",
    "PEGRatio": "1.2818",
    "BookValue": "18.304",
    "DividendPerShare": "0.92",
    "DividendYield": "0.0204",
    "EPS": "2.49",
    "RevenuePerShareTTM": "23.142",
    "ProfitMargin": "0.1091",
    "OperatingMarginTTM": "0.1903",
    "ReturnOnAssetsTTM": "0.048",
    "ReturnOnEquityTTM": "0.1419",
    "RevenueTTM": "105548996608",
    "GrossProfitTTM": "74502000000",
    "DilutedEPSTTM": "2.49",
    "QuarterlyEarningsGrowthYOY": "-0.044",
    "QuarterlyRevenueGrowthYOY": "-0.117",
    "AnalystTargetPrice": "51.32",
    "TrailingPE": "18.0964",
    "ForwardPE": "15.1976",
    "PriceToSalesRatioTTM": "1.9704",
    "PriceToBookRatio": "2.4618",
    "EVToRevenue": "2.8111",
    "EVToEBITDA": "9.1319",
    "Beta": "0.9388",
    "52WeekHigh": "47.74",
    "52WeekLow": "31.705",
    "50DayMovingAverage": "45.3506",
    "200DayMovingAverage": "41.5536",
    "SharesOutstanding": "4558660096",
    "SharesFloat": "4526576579",
    "SharesShort": "80155155",
    "SharesShortPriorMonth": "76469187",
    "ShortRatio": "3.9",
    "ShortPercentOutstanding": "0.02",
    "ShortPercentFloat": "0.0177",
    "PercentInsiders": "0.695",
    "PercentInstitutions": "85.055",
    "ForwardAnnualDividendRate": "0.92",
    "ForwardAnnualDividendYield": "0.0204",
    "PayoutRatio": "0.302",
    "DividendDate": "2020-10-28",
    "ExDividendDate": "2020-10-06",
    "LastSplitFactor": "2:1",
    "LastSplitDate": "2017-02-21"
}