{
    "Symbol": "IBM",
    "AssetType": "Common Stock",
    "Name": "International Business Machines Corporation",
    "Description": "International Business Machines Corporation operates as an integrated solutions and services company worldwide. Its Cloud & Cognitive Software segment offers software for vertical and domain-specific solutions in health, financial services, and Internet of Things (IoT), weather, and security software and services application areas; and customer information control system and storage, and analytics and integration software solutions to support client mission critical on-premise workloads in banking, airline, and retail industries. It also offers middleware and data platform software, including Red Hat, which enables the operation of clients' hybrid multi-cloud environments; and Cloud Paks, WebSphere distributed, and analytics platform software, such as DB2 distributed, information integration, and enterprise content management, as well as IoT, Blockchain and AI/Watson platforms. The company's Global Business Services segment offers business consulting services; system integration, application management, maintenance, and support services for packaged software; finance, procurement, talent and engagement, industry-specific business process outsourcing services; IT infrastructure and platform services. Its Global Technology Services segment provides project, managed, outsourcing, and cloud-delivered services for enterprise IT infrastructure environments; and IT infrastructure support services. It's Systems segment offers servers for businesses, cloud service providers, and scientific computing organizations; data storage products and solutions; and z/OS, an enterprise operating system, as well as Linux. Its Global Financing segment provides lease, installment payment, loan financing, short-term working capital financing, and remanufacturing and remarketing services. It was formerly known as Computing-Tabulating-Recording Co. and changed its name to International Business Machines Corporation in 1924. It was founded in 1911 and is headquartered in Armonk, New York.",
    "Exchange": "NYSE",
    "Currency": "USD",
    "Country": "USA",
    "Sector": "Technology",
    "Industry": "Information Technology Services",
    "Address": "One New Orchard Road, Armonk, NY, United States, 10504",
    "FullTimeEmployees": "352600",
    "FiscalYearEnd": "December",
    "LatestQuarter": "2020-09-30",
    "MarketCapitalization": "103307165696",
    "EBITDA": "16051999744",
    "PERatio": "13.1099",
    "PEGRatio": "7.6619",
    "BookValue": "23.792",
    "DividendPerShare": "6.52",
    "DividendYield": "0.0562",
    "EPS": "8.822",
    "RevenuePerShareTTM": "84.402",
    "ProfitMargin": "0.1053",
    "OperatingMarginTTM": "0.1254",
    "ReturnOnAssetsTTM": "0.0387",
    "ReturnOnEquityTTM": "0.401",
    "RevenueTTM": "75030003712",
    "GrossProfitTTM": "36489000000",
    "DilutedEPSTTM": "8.822",
    "QuarterlyEarningsGrowthYOY": "0.009",
    "QuarterlyRevenueGrowthYOY": "-0.026",
    "AnalystTargetPrice": "136.87",
    "TrailingPE": "13.1099",
    "ForwardPE": "9.8814",
    "PriceToSalesRatioTTM": "1.3813",
    "PriceToBookRatio": "4.8611",
    "EVToRevenue": "2.1043",
    "EVToEBITDA": "10.3112",
    "Beta": "1.1572",
    "52WeekHigh": "158.75",
    "52WeekLow": "90.56",
    "50DayMovingAverage": "122.0782",
    "200DayMovingAverage": "122.8181",
    "SharesOutstanding": "890579008",
    "SharesFloat": "890009416",
    "SharesShort": "21800506",
    "SharesShortPriorMonth": "22629603",
    "ShortRatio": "5.37",
    "ShortPercentOutstanding": "0.02",
    "ShortPercentFloat": "0.0245",
    "PercentInsiders": "0.108",
    "PercentInstitutions": "58.555",
    "ForwardAnnualDividendRate": "6.52",
    "ForwardAnnualDividendYield": "0.0562",
    "PayoutRatio": "0.5697",
    "DividendDate": "2020-09-10",
    "ExDividendDate": "2020-08-07",
    "LastSplitFactor": "2:1",
    "LastSplitDate": "1999-05-27"
}