{
    "Symbol": "T",
    "AssetType": "Common Stock",
    "Name": "AT&T Inc",
    "Description": "AT&T Inc. provides telecommunication, media, and technology services worldwide. The company operates through four segments: Communications, WarnerMedia, Latin America, and Xandr. The Communications segment provides wireless and wireline telecom, video, and broadband and Internet services; video entertainment services using satellite, IP-based, and streaming options; and audio programming services under the AT&T, Cricket, AT&T PREPAID, and DIRECTV brands to residential and business customers. This segment also sells handsets, wirelessly enabled computers, and wireless data cards manufactured by various suppliers for use with company's voice and data services, as well as various accessories, such as carrying cases and hands-free devices through the company-owned stores, agents, and third-party retail stores. The WarnerMedia segment primarily produces, distributes, and licenses television programming and feature films; distributes home entertainment products in physical and digital formats; and produces and distributes mobile and console games, and consumer products, as well as offers brand licensing services. It also operates cable networks, multichannel premium pay television, and over-the-top services; and digital media properties. The Latin America segment offers video entertainment and audio programming services under the DIRECTV and SKY brands primarily to residential customers; pay-TV services, including HD sports video content; and postpaid and prepaid wireless services under the AT&T and Unefon brands, as well as sells various handsets through company-owned stores, agents, and third-party retail stores. The Xandr segment provides digital and video advertising services. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in November 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.",
    "Exchange": "NYSE",
    "Currency": "USD",
    "Country": "USA",
    "Sector": "Communication Services",
    "Industry": "Telecom Services",
    "Address": "208 South Akard Street, Dallas, TX, United States, 75202",
    "FullTimeEmployees": "247800",
    "FiscalYearEnd": "December",
    "LatestQuarter": "2020-06-30",
    "MarketCapitalization": "198226411520",
    "EBITDA": "49956999168",
    "PERatio": "18.4238",
    "PEGRatio": "7.0199",
    "BookValue": "24.639",
    "DividendPerShare": "2.08",
    "DividendYield": "0.0748",
    "EPS": "1.513",
    "RevenuePerShareTTM": "24.018",
    "ProfitMargin": "0.0642",
    "OperatingMarginTTM": "0.1433",
    "ReturnOnAssetsTTM": "0.0285",
    "ReturnOnEquityTTM": "0.0637",
    "RevenueTTM": "172889997312",
    "GrossProfitTTM": "97052000000",
    "DilutedEPSTTM": "1.513",
    "QuarterlyEarningsGrowthYOY": "-0.233",
    "QuarterlyRevenueGrowthYOY": "-0.05",
    "AnalystTargetPrice": "31.96",
    "TrailingPE": "18.4238",
    "ForwardPE": "8.7032",
    "PriceToSalesRatioTTM": "1.1626",
    "PriceToBookRatio": "1.1292",
    "EVToRevenue": "2.1366",
    "EVToEBITDA": "7.0479",
    "Beta": "0.6509",
    "52WeekHigh": "39.7",
    "52WeekLow": "26.08",
    "50DayMovingAverage": "28.3371",
    "200DayMovingAverage": "29.672",
    "SharesOutstanding": "7125000192",
    "SharesFloat": "7115523750",
    "SharesShort": "118866643",
    "SharesShortPriorMonth": "112846131",
    "ShortRatio": "3.23",
    "ShortPercentOutstanding": "0.02",
    "ShortPercentFloat": "0.0167",
    "PercentInsiders": "0.081",
    "PercentInstitutions": "57.414",
    "ForwardAnnualDividendRate": "2.08",
    "ForwardAnnualDividendYield": "0.0748",
    "PayoutRatio": "0.5943",
    "DividendDate": "2020-11-02",
    "ExDividendDate": "2020-10-08",
    "LastSplitFactor": "2:1",
    "LastSplitDate": "1998-03-20"
}