{
    "Symbol": "VZ",
    "AssetType": "Common Stock",
    "Name": "Verizon Communications Inc",
    "Description": "Verizon Communications Inc. offers communications, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. Its Consumer segment provides postpaid and prepaid service plans; Internet access on notebook computers and tablets; wireless equipment, including smartphones and other handsets; and wireless-enabled Internet devices, such as tablets, laptop computers and netbooks, and other wireless-enabled connected devices, such as smart watches and other wearables. It also provides residential fixed connectivity solutions, including Internet, video, and voice services; and sells network access to mobile virtual network operators. As of December 31, 2019, it had approximately 95 million wireless retail connections, 6 million broadband connections, and 4 million Fios video connections. The company's Business segment provides network connectivity products, including private networking, private cloud connectivity, virtual and software defined networking, and Internet access services; and Internet protocol-based voice services, unified communications and collaboration tools, and customer contact center solutions. It also offers a suite of management and data security services; domestic and global voice and data solutions, including voice calling, messaging services, conferencing, contact center solutions, and private line and data access networks; customer premises equipment; installation, maintenance, and site services; and IoT products and services. This segment had 25 million wireless retail postpaid connections and 489 thousand broadband connections. The company has strategic partnership with HERE Technologies and Dignitas; and Emory Healthcare to develop and test 5G Ultra Wideband-enabled use cases. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was founded in 1983 and is headquartered in New York, New York.",
    "Exchange": "NYSE",
    "Currency": "USD",
    "Country": "USA",
    "Sector": "Communication Services",
    "Industry": "Telecom Services",
    "Address": "1095 Avenue of the Americas, New York, NY, United States, 10036",
    "FullTimeEmployees": "133200",
    "FiscalYearEnd": "December",
    "LatestQuarter": "2020-09-30",
    "MarketCapitalization": "239841378304",
    "EBITDA": "46028001280",
    "PERatio": "12.9706",
    "PEGRatio": "3.8788",
    "BookValue": "15.725",
    "DividendPerShare": "2.51",
    "DividendYield": "0.0433",
    "EPS": "4.42",
    "RevenuePerShareTTM": "31.018",
    "ProfitMargin": "0.1426",
    "OperatingMarginTTM": "0.229",
    "ReturnOnAssetsTTM": "0.0632",
    "ReturnOnEquityTTM": "0.2972",
    "RevenueTTM": "128374996992",
    "GrossProfitTTM": "77142000000",
    "DilutedEPSTTM": "4.42",
    "QuarterlyEarningsGrowthYOY": "-0.16",
    "QuarterlyRevenueGrowthYOY": "-0.041",
    "AnalystTargetPrice": "61.26",
    "TrailingPE": "12.9706",
    "ForwardPE": "11.6144",
    "PriceToSalesRatioTTM": "1.8492",
    "PriceToBookRatio": "3.6459",
    "EVToRevenue": "2.8468",
    "EVToEBITDA": "8.6234",
    "Beta": "0.4098",
    "52WeekHigh": "62.1499",
    "52WeekLow": "48.84",
    "50DayMovingAverage": "59.1953",
    "200DayMovingAverage": "57.4241",
    "SharesOutstanding": "4138050048",
    "SharesFloat": "4135020640",
    "SharesShort": "27017981",
    "SharesShortPriorMonth": "30056286",
    "ShortRatio": "1.78",
    "ShortPercentOutstanding": "0.01",
    "ShortPercentFloat": "0.0065",
    "PercentInsiders": "0.027",
    "PercentInstitutions": "68.435",
    "ForwardAnnualDividendRate": "2.51",
    "ForwardAnnualDividendYield": "0.0433",
    "PayoutRatio": "0.513",
    "DividendDate": "2020-11-02",
    "ExDividendDate": "2020-10-08",
    "LastSplitFactor": "1000000:93",
    "LastSplitDate": "2010-07-02"
}